<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
 <dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Office 365 SKU-less installer package.
Override the PRODUCTID key to:
- 525133 for Americas
- 532572 for Europe
- 532577 for Asia
- 871743 for Office 2016
- 2009112 for Office365 Business Pro (includes Teams)
</string>
	<key>Identifier</key>
	<string>com.github.lifesci-IT.autopkgrecipes.download.MicrosoftOffice365</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOADURL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
		<key>NAME</key>
		<string>Microsoft Office Suite</string>
		<key>PKG_NAME</key>
		<string>MicrosoftOffice365Suite</string>
		<key>PRODUCTID</key>
		<string>2009112</string>
		<key>STOPPROCESSINGIF_PREDICATE</key>
		<string>download_changed == FALSE</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%PKG_NAME%.pkg</string>
				<key>url</key>
				<string>%DOWNLOADURL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%STOPPROCESSINGIF_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
